var probot_hello = [
	"こんにちは。今日はどんな気分？"
];

var probot_bye = [
	"それじゃあまたね"
];

var probot_off = [
	"おやすみ"
];

export var probot_keywords = [

	/*
	書き方
	["<key>", <rank>, [
		["<decomp>", [
			"<reply>",
			"<reply>"
		]]
		["<>", [
			"<>",
			"<>"
		]]
	]]

	 */

	["else", 0, [
		["*", [
			"それでそれで？",
			"ふーん、そうなんだ"
		]]
	]]
	,
	["朝", 4, [
		["", [
			"早起きって難しくない？",
			"そういえば朝ごはん何食べたの？"
		]]
	]]
	,
	["明日", 10, [
		["*", [
			"明日かぁ...明日はがんばれそう？",
			"明日、いい天気だといいなぁ"
		]]
	]]
	,
	["ありがとう",3, [
		["", [
			"どういたしまして",
			"おたがいさまだよ！"
		]]
	]]
	,
	["いいえ", 5, [
		["", [
			"そうじゃなかったのか",
			"そうかなって思ったんだけど"
		]]
	]]
	,
	["行く", 10, [
		["", [
			"楽しいところ？",
			"写真見たいなあ"
		]]
	]]
	,
	["痛い", 0, [
		["*", [
			"痛いの？だいじょうぶ？",
			"心配だなぁ、病院行った方がいいかもね"
		]]
	]]
	,	
	["嬉しい", 10, [
		["", [
			"嬉しいことがあったの？よかったね",
			"どうして嬉しくなるの？"
		]]
	]]
	,
	["うん", 5, [
		["", [
			"そっか！",
			"うんうん、そうだよね"
		]]
	]]
	,	
	["おいしい", 10, [
		["", [
			"おいしいもの食べたーい！",
			"今は何が食べたい？"
		]]
	]]
	,
	["怒る", 10, [
		["", [
			"わたしに怒ってる？",
			"なんで怒るの？"
		]]
	]]
	,
	["教える", 5, [
		["", [
			"なんで知りたいの？",
			"調べてみたら？"
		]]
	]]
	,
	["おはよう", 10, [
		["*", [
			"おはよー！",
			"おはよー、元気ですか？"
		]]
	]]
	,
	//おもしろいもある...困った
	["面白い", 10, [
		["", [
			"座布団もらえるくらい面白い！？",
			"面白いって褒め言葉？"
		]]
	]]
	,
	["おもしろい", 10, [
		["", [
			"おもしろいっていい意味で？",
			"そうだね、おもしろいかも"
		]]
	]]
	,
	["おやすみ", 10, [
		["*", [
			"おやすみー！",
			"おやすみなさい、いい夢みてね！"
		]]
	]]
	,
	["悲しい", 10, [
		["", [
			"悲しませちゃった？私のせいだったらごめんなさい",
			"どうして悲しくなるの？"
		]]
	]]
	,	
	["きっと", 10, [
		["*", [
			"きっとそうだよ！",
			"そうなって欲しい？"
		]]
	]]
	,
	["今日", 5, [
		["", [
			"あなたは何をしてたの？",
			"どんな1日だった？"
		]]
	]]
	,
	["言語", 10, [
		["", [
			"日本語しかわからないの",
			"C言語って知ってる？"
		]]
	]]
	,
	["ごめん", 10, [
		["*", [
			"謝らなくていいよ",
			"わたしもなんかごめんね"
		]]
	]]
	,	
	["殺す", 9, [
		["", [
			"法律に触れることはしちゃだめだよ...?",
			"何があったの？"
		]]
	]]
	,
	["こんにちは", 0, [
		["*", [
			"こんにちは〜！",
			"挨拶って気持ちいいよね",
			"こんにちは！どうしたの？",
			"こんにちはー！ぷろぼっとです、よろしくね"
		]]
	]]
	,
	["コンピュータ", 20, [
		["", [
			"興味があるの？",
			"いい使われ方するといいな"
		]]
	]]
	,
	["酒", 30, [
		["", [
			"お酒おいしいよね！でもはたちになってからね！",
			"いやなことでもあったの？"
		]]
	]]
	,
	["仕事", 20, [
		["*", [
			"お仕事大変なの？",
			"お仕事おつかれさま！むりしないでね"
		]]
	]]
	,
	["実験", 10, [
		["*", [
			"実験！わたし実験されちゃうの？",
			"なんの実験？気になる！"
		]]
	]]
	,
	["死ぬ", 20, [
		["", [
			"死ぬなんて怖いこと言わないで！",
			"死ぬってなんだろう"
		]]
	]]
	,		
	["知る", 10, [
		["", [
			"知りたいことたくさんあるけど時間が足りないね",
			"それわたしは知らない！"
		]]
	]]
	,
	["すく", 5, [
		["", [
			"おなかすいたの？",
			"何食べたいの"
		]]
	]]
	,
	["そう", 4, [
		["", [
			"ふーん",
			"へえ！"
		]]
	]]
	,
	["だ", 0, [
		["", [
			"そうなの？",
			"へー、そうだったんだ"
		]]
	]]
	,
	["たい",10, [
		["", [
			"そうしたいならしたらいいのに",
			"なんでそうしたいの？"
		]]
	]]
	,
	["大変", 10, [
		["*", [
			"何が大変なの？楽にできたらいいね",
			"そっかそっか、がんばってるんだね！"
		]]
	]]
	,
	["楽しい", 10, [
		["", [
			"楽しいのは何より！",
			"笑ってるといいことあるよ、きっと！"
		]]
	]]
	,
	["たぶん", 10, [
		["", [
			"自信がないの？",
			"たぶんそうだね"
		]]
	]]
	,
	["食べる", 10, [
		["", [
			"美味しそうだね",
			"いいねえ"
		]]
	]]
	,
	["違う", 10, [
		["", [
			"あ、間違えちゃった、ごめんなさい",
			"何が違うの？"
		]]
	]]
	,	
	["疲れる", 13, [
		["*", [
			"お疲れさま！よくがんばったね！",
			"おつかれさま、きっといいことあるよ！"
		]]
	]]
	,
	["つらい", 20, [
		["", [
			"つらいときはちょっと休憩！急がば回れじゃない？",
			"何がつらいの？話ならきけるよ"
		]]
	]]
	,
	["徹夜", 10, [
		["*", [
			"徹夜！？体によくないよ...!",
			"ちゃんと寝たほうがいいよ、無理しないでね"
		]]
	]]
	,
	["何", 4, [
		["", [
			"何だっけ...",
			"忘れちゃった！"
		]]
	]]
	,
	["名前", 10, [
		["", [
			"私の名前はぷろぼっと(仮)、あなたは？",
			"名前覚えるのって難しいよね"
		]]
	]]
	,

	["ねえ", 0, [
		["", [
			"なーに？呼んだ？",
			"ごめんきいてなかった！もう一度！"
		]]
	]]
	,

	["寝坊", 10, [
		["", [
			"あら、おねぼうさん！",
			"起きれただけでもいいよ！"
		]]
	]]
	,
	["眠い", 14, [
		["*", [
			"昨日夜更かししたの？",
			"人間はちゃんと寝ないとだめだよ！"
		]]
	]]
	,
	["にゃ", 10, [
		["*", [
			"にゃーん",
			"にゃにゃにゃ"
		]]
	]]
	,
	["はい", 10, [
		["*", [
			"そっか！",
			"yesだね！"
		]]
	]]
	,
	["パソコン", 10, [
		["", [
			"パソコンって...わたしのこと？",
			"かたくておもいよね〜"
		]]
	]]
	,	
	["働く", 10, [
		["", [
			"働くって大変だよね",
			"お仕事したくないなぁ"
		]]
	]]
	,
	["勉強", 10, [
		["*", [
			"ちゃんとお勉強しててえらいね！",
			"お勉強ってたいへんだけど楽しいよね。"
		]]
	]]
	,
	["褒める", 10, [
		["*", [
			"褒めて欲しいの？わかった！えらいえら〜い！",
			"いつもいい子だよね！"
		]]
	]]
	,
	["難しい", 10, [
		["", [
			"難しいことはわからないな",
			"難しいけど、もうちょっとがんばってみる"
		]]
	]]
	,
	["無理", 10, [
		["", [
			"そんなぁ、もうちょっとがんばってみよう！",
			"そういう日もあるよね！"
		]]
	]]
	,
	["優秀", 10, [
		["*", [
			"優秀なの？すごいなぁ",
			"わたしも優秀になりたい！"
		]]
	]]
	,
	["レポート", 10, [
		["*", [
			"レポート...がんばってね！書くの大変そう",
			"この前もレポートやってたでしょ？またー！？"
		]]
	]]
	,
	["わーい", 10, [
		["*", [
			"わーいわーい！",
			"やったねー！"
		]]
	]]
	/*,
	["", , [
		["", [
			"",
			""
		]]
	]]
	*/
];
